#+title: clif: The common lisp interactive fiction system
#+AUTHOR: Fernando Raul Rodriguez Flores
#+AUTHOR: Marian S. Álvarez Suri

#+TODO: HERE TODO | DONE

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (text "This is a test for a paragraph"))
          (l2 (text "This is a test" " for a paragraph" " with a list as content")))
     (bformat t "testing the constructor for text")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ==================================
   :  testing the constructor for text
   : ==================================
   : 
   : <<text: (This is a test for a paragraph)>>
   : <<text: (This is a test  for a paragraph  with a list as content)>>

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (title "This is a test for a title"))
          (l2 (title "This is a test" " for a title" " with a list as content")))
     (bformat t "testing the constructor for title")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ==================================
   :  testing the constructor for text
   : ==================================
   : 
   : <<text: (This is a test for a paragraph)>>
   : <<text: (This is a test  for a paragraph  with a list as content)>>
**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (subtitle "This is a test for a subtitle"))
          (l2 (subtitle "This is a test" " for a subtitle" " with a list as content")))
     (bformat t "testing the constructor for subtitle")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ======================================
   :  testing the constructor for subtitle
   : ======================================
   : 
   : <<subtitle: (This is a test for a subtitle)>>
   : <<subtitle: (This is a test  for a subtitle  with a list as content)>>
**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (item "Element 1"))
          (l2 (item "With a list of elements")))
     (bformat t "testing the constructor for item")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ==================================
   :  testing the constructor for item
   : ==================================
   : 
   : <<item: (Element 1)>>
   : <<item: (With a list of elements)>>



#+end_src
**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (enumerate "Element 1" "element2"))
          (l2 (enumerate (item "element1") (item "element2"))))
     (bformat t "Testing the constructor for enumerate")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : =======================================
   :  Testing the constructor for enumerate
   : =======================================
   : 
   : <<list: (Element 1 element2)>>
   : <<list: (<<item: (element1)>> <<item: (element2)>>)>>



#+end_src

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (itemize "Element 1" "element2"))
          (l2 (itemize (item "element1") (item "element2"))))
     (bformat t "Testing the constructor for itemize")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : =====================================
   :  Testing the constructor for itemize
   : =====================================
   : 
   : <<list: (Element 1 element2)>>
   : <<list: (<<item: (element1)>> <<item: (element2)>>)>>



#+end_src

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (newline)))
     (bformat t "Testing the constructor for enumerate")
     (format t "~a~%" l1))
   #+end_src

   #+RESULTS:
   : =======================================
   :  Testing the constructor for enumerate
   : =======================================
   : 
   : <<newline>>

-------------------------------------------------------------
**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (b "hola mundo")))
     (bformat t "Testing the constructor for bold")
     (format t "~a~%" l1))
   #+end_src

   #+RESULTS:
   : ==================================
   :  Testing the constructor for bold
   : ==================================
   : 
   : <<b (hola mundo)>>

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (it "hola mundo")))
     (bformat t "Testing the constructor for italic")
     (format t "~a~%" l1))
   #+end_src

   #+RESULTS:
   : ====================================
   :  Testing the constructor for italic
   : ====================================
   : 
   : <<it (hola mundo)>>

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (tt "hola mundo")))
     (bformat t "Testing the constructor for monospace")
     (format t "~a~%" l1))
   #+end_src

   #+RESULTS:
   : =======================================
   :  Testing the constructor for monospace
   : =======================================
   : 
   : <<tt (hola mundo)>>

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (strike "not so hola mundo")))
     (bformat t "Testing the constructor for strike")
     (format t "~a~%" l1))
   #+end_src

   #+RESULTS:
   : ====================================
   :  Testing the constructor for strike
   : ====================================
   : 
   : <<strike (not so hola mundo)>>

**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (underline "underlined hola mundo")))
     (bformat t "Testing the constructor for underline")
     (format t "~a~%" l1))
   #+end_src

   #+RESULTS:
   : =======================================
   :  Testing the constructor for underline
   : =======================================
   : 
   : <<underline (underlined hola mundo)>>

--------------------------------------------------------------
**** tests
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (link test1 "click here to go to 'test1"))
          (l2 (link test2 "click here " "to go to 'test2")))
     (bformat t "testing the constructor for link")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ==================================
   :  testing the constructor for link
   : ==================================
   : 
   : <<link to (TEST1): (click here to go to 'test1)>>
   : <<link to (test2): (click here  to go to 'test2)>>

**** tests
 #+begin_src lisp :results output :export code :tangle src/tests.lisp
(let* ((l1 (image "/home/marian/Pictures/firma.jpg"
		   "mi firma"
		   :align :center
		   :size "20x3"))
	(l2 (image "/home/marian/Pictures/firma.jpg"
		   "mi firma")))
   (bformat t "testing the constructor for image")
   (format t "~a~%" l1)
   (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ===================================
   :  testing the constructor for image
   : ===================================
   : 
   : <<Image: mi firma from /home/marian/Pictures/firma.jpg with align CENTER and size 20x3>>
   : <<Image: mi firma from /home/marian/Pictures/firma.jpg with align NIL and size NIL>>

**** tests
 #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (start-sound "/home/marian/sound/rain.mp3"
		      :alt-text "rain in the background"))
	   (l2 (start-sound "/home/marian/sound/rain.mp3")))

      (bformat t "testing the constructor for sound")
      (format t "~a~%" l1)
      (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ===================================
   :  testing the constructor for sound
   : ===================================
   : 
   : <<Sound: rain in the background from /home/marian/sound/rain.mp3>>
   : <<Sound: You can listen to some sound in the background from /home/marian/sound/rain.mp3>>

**** tests
 #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* ((l1 (whiteboard "TITULO"
		      "Marian S. aaaa"
                        (text "prueba")))
	   (l2 (whiteboard "SIN TITULO JAJAJAJ" "ANONIMO")))
      (bformat t "testing the constructor for whiteboard")
      (format t "~a~%" l1)
      (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ========================================
   :  testing the constructor for whiteboard
   : ========================================
   : 
   : <<Whiteboard: TITULO by Marian S. aaaa>> (<<text: (prueba)>>)
   : <<Whiteboard: SIN TITULO JAJAJAJ by ANONIMO>> NIL

***** test viejito
   #+begin_src lisp :results output :export code
   (let* ((l1 (link test1 "click here to go to 'test1"))
          (l2 (link test2 "click here " "to go to 'test2")))
     (bformat t "testing the constructor for link")
     (format t "~a~%" l1)
     (format t "~a~%" l2))
   #+end_src

   #+RESULTS:
   : ==================================
   :  testing the constructor for link
   : ==================================
   : 
   : <<link to (TEST1): (click here to go to 'test1)>>
   : <<link to (test2): (click here  to go to 'test2)>>


***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (generate-code 4 html t)
      #+end_src

      #+RESULTS:
      : 4

***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (generate-code "hello world!" html t)
      #+end_src

      #+RESULTS:
      : hello world!

***** test
#+BEGIN_SRC lisp +n -r :results output :exports none :tangle src/tests.lisp
(let* ((l1 (newline)))
  (generate-code l1 html t))
#+END_SRC

#+RESULTS:
: <br>

***** test
#+BEGIN_SRC lisp +n -r :results output :exports none :tangle src/tests.lisp
(let* ((l1 (item "Hello itemized world"))
       (l2 (item "Hello " (b "itemized") " world")))
  (generate-code l1 html t)
  (terpri)
  (generate-code l2 html t))
#+END_SRC

#+RESULTS:
: <li>Hello itemized world</li>
***** test
#+BEGIN_SRC lisp +n -r :results output :exports none :tangle src/tests.lisp
(let* ((l1 (enumerate (item "Element 1")
                      (item "Element 2"))))
  (generate-code l1 html t))
#+END_SRC

#+RESULTS:
: <li>Hello itemized world</li>
***** test
#+BEGIN_SRC lisp +n -r :results output :exports none :tangle src/tests.lisp
(let* ((list2 (itemize (item "Element 1")
                      (item "Element 2"))))
  (generate-code list2 html t))
#+END_SRC

#+RESULTS:
: <ul>
:   <li>Element 1</li>
:   <li>Element 2</li>
: </ul>

***** test
#+BEGIN_SRC lisp +n -r :results output :exports none :tangle src/tests.lisp
(let* ((l1 (link final "listo para terminar")))
  (generate-code l1 html t))
#+END_SRC

#+RESULTS:
: <a href='FINAL'>listo para terminar</a>
***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ()

        (bformat t "testing initialize-undum. check /tmp/clif.html")
        (with-open-file (f "/tmp/clif.html" :direction :output
                           :if-exists :supersede)
          (initialize-undum t undum f)))
      #+end_src

      #+RESULTS:
      : ================================================
      :  testing initialize-undum. check /tmp/clif.html
      : ================================================
      : 
      
***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((bs1 (basic-situation 'test1
                                   "hello world,"
                                   " my first situation"
                                   ", with 3 lines"))
             (bs2 (basic-situation 'test2
                                   "<h1>Un juego con una sola situación</h1>"
                                   "<p>Esta es una única situación, con texto.</p>."
                                   "<p>Presiona <a href='ultimo'>aquí para terminar...</a></p>")))
        (bformat t "testing generate-code for basic situation")
        (generate-code bs1 undum t)
        (terpri) (terpri)
        (generate-code bs2 undum t))
      #+end_src

      #+RESULTS:
      : <a href='START'>al comienzo otra vez...</a>

***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((l1 (link "test1" "click here to go to 'test1"))
                (l2 (link "test2" :transient "click here to go to 'test2"))
                (l3 (link "test3" :transient "click here to go" " to 'test2" " with list"))
                (l4 (link "test4" :transient "click here to go" :another_class " to 'test2" " with list")))
        (bformat t "testing the code-generation for link")
        (generate-code l1 undum t) (terpri)
        (generate-code l2 undum t) (terpri)
        (generate-code l3 undum t) (terpri)
        (generate-code l4 undum t) (terpri))
      #+end_src

      #+RESULTS:
      : <a href='START'>al comienzo otra vez...</a>

****** test within a story to a file
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((bs1 (basic-situation "start"
                                   "<h1>Un juego con una sola situación</h1>"
                                   (nline)
                                   "<p>Esta es una única situación, con texto.</p>"
                                   (nline)
                                   "<p>Presiona " (link "ultimo" "aquí para terminar.") "</p>"))
             (bs2 (basic-situation "ultimo"
                                   "<p class='transient'>Felicitaciones</p>"
                                   (nline)
                                   "<p>Has terminado tu primera aventura</p>"
                                   (nline)
                                   "<p>FIN</p>"))
             (story1 (story (list bs1 bs2) "start")))

        (bformat t "testing generate-code to a file for a story")
        (with-open-file (f "/tmp/undum-game.js" :direction :output
                           :if-exists :supersede)
            (generate-code story1 undum f)))
      #+end_src

      #+RESULTS:
      : =============================================
      :  testing generate-code to a file for a story
      : =============================================
      : 

***** test v1
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((l1 (h1 "This is a test for a header"))
             (l2 (h1 "This is a test" " for a header" " with list as contents"))
             (l3 (h1 :transient "This is a test"))
             (l4 (h1 :transient "This is a test" :with_2_classes " with css-classes")))
        (bformat t "testing the constructor for h1")
        (generate-code l1 undum t)
        (terpri)
        (generate-code l2 undum t)
        (terpri)
        (generate-code l3 undum t)
        (terpri)
        (generate-code l4 undum t))
      #+end_src

      #+RESULTS:
      : <h1>This is a test for a header</h1>

***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((l1 (p "This is a test for a paragraph"))
             (l2 (p "This is a test" " for a paragraph" " with list as contents"))
             (l3 (p :transient "This is a test"))
             (l4 (p :transient "This is a test" :with_2_classes " with css-classes")))
        (bformat t "testing the code generation for <p>")
        (generate-code l1 undum t)
        (terpri)
        (generate-code l2 undum t)
        (terpri)
        (generate-code l3 undum t)
        (terpri)
        (generate-code l4 undum t))
      #+end_src

      #+RESULTS:
      : <h1>This is a test for a header</h1>
      
***** test
#+BEGIN_SRC lisp +n -r :results output :exports none :tangle src/tests.lisp
(let* ((list2 (itemize (item "Element 1")
                      (item "Element 2"))))
  (generate-code list2 html t))
#+END_SRC

#+RESULTS:
: <ul>
:   <li>Element 1</li>
:   <li>Element 2</li>
: </ul>

** test2 (using some html elements p and h1, with css-classes)
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* (start
          last
          story1) 
     (bformat t "testing a full story")
     (setf start (basic-situation
                  "start"
                  (h1 "A game with only one situation, but with h1 and p and css")
                  (nline)
                  (p "This is the only situation, with text.")
                  (nline)
                  (p :transient "And this should dissapear...  :-o")
                  (nline)
                  (p :transient "Click" (link "last"" here to end..."))))

     (setf last (basic-situation
                 "last"
                 (p "Congratulations.")
                  (nline)
                 (p "You finished your first adventure.")
                  (nline)
                 (p "THE END")))
     (setf story1 (story (list start last) "start"))
     (format t "~a~%" start)
     (format t "~a~%" last)
     (with-open-file (f "/tmp/undum-game.js"
                        :direction :output
                        :if-exists :supersede)
       (generate-code story1 undum f)))
   #+end_src

   #+RESULTS:
   #+begin_example
   ======================
    testing a full story
   ======================

   basicSituation (start): (<<H1 NIL: (A game with only one situation, but with h1 and p and css)>>
                            <<newline>>
                            <<p NIL: (This is the only situation, with text.)>>
                            <<newline>>
                            <<p (transient): (And this should dissapear...  :-o)>>
                            <<newline>>
                            <<p (transient): (Click
                                              <<link NIL to (last): ( here to end...)>>)>>)
   basicSituation (last): (<<p NIL: (Congratulations.)>> <<newline>>
                           <<p NIL: (You finished your first adventure.)>>
                           <<newline>> <<p NIL: (THE END)>>)
   #+end_example

